src/Documents/СчетФактураВыданный/СчетФактураВыданный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СчетФактураВыданный</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4e4cf733-ae36-41e3-9e65-49294b2822e4">
    <name>ДоговорКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЗаРуководителяНаОсновании</name>
    <type>
      <types>CatalogRef.ОснованияПраваПодписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаГлавногоБухгалтераНаОсновании</name>
    <type>
      <types>CatalogRef.ОснованияПраваПодписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаОформление</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="f3ed5b05-6e05-47b5-ac13-48b85b5bd91d">
    <name>ВидСчетаФактуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="576b28f8-a65d-4f61-a2b2-9d72c22b7e7e">
    <name>ВалютаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7aa475d8-1822-401c-ab1d-d99810da9f56">
    <name>Руководитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="60b0d242-b4b4-4310-b40d-94194cfd9d1a">
    <name>Продавец</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="362f0a29-aed2-4b8d-8763-acae766e1df2">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4c667195-b2a5-44a1-93cb-7d4c0ed2d04c">
    <name>Комитент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="20b3e1bb-944e-42f3-8fee-ebb82dc8d2c2">
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ba8d6410-05fb-4730-969c-2d82ec83e7f9">
    <name>СуммаНДС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b6443060-cc6a-4477-82cf-6a16f65b2119">
    <name>СтавкаНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ДокументыОснования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ДокументОснование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="ecf54e9c-0d42-46b3-aadb-7dfaa05397c7">
    <name>Авансы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="2caa5cf5-ded2-4369-8402-8fa3450c8685">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="3353df2e-3184-4a66-86a1-71f21bbd0674">
      <name>Содержание</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>1000</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="5ea7fa44-2665-4e9b-98e9-a3047b93d387">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>14</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="cbb05a15-7193-4970-980e-ea3e131c4e08">
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>14</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="4c873bb9-db0b-40c9-85b5-78362127576c">
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b987402a-2b16-4795-87e4-9d31f25e213a">
      <name>Контрагент</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Enums/ОтветственныеЛицаОрганизаций/ОтветственныеЛицаОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="97a5f1f4-6332-4100-9848-6c0907797835">
  <name>ОтветственныеЛицаОрганизаций</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="6149f789-afe7-422c-a493-7ed022301a1f">
    <name>Руководитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b684c73e-a0ee-430e-b257-6a45d3bfa9e8">
    <name>ГлавныйБухгалтер</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="191ec1b3-93f5-4262-badb-918736bb561a">
    <name>ОтветственныйЗаОформление</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/Documents/СчетФактураВыданный/ObjectModule.bsl
&После("ПередЗаписью")
Процедура Базар_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	
	ДокументОснования = Неопределено;
	Если ДокументыОснования.Количество() = 1 тогда
		ПерваяСтрока = ДокументыОснования.Получить(0);
		
		Если ТипЗнч(ПерваяСтрока.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") тогда
			ДокументОснования = ПерваяСтрока.ДокументОснование;
		КонецЕсли;
	КонецЕсли;
	
	Если ДокументОснования = Неопределено тогда
		
		ПодписиУполномоченныхЛиц = ОтветственныеЛицаБП.РеквизитыПодписиУполномоченныхЛиц(Организация,
		                                                                                 ПользователиКлиентСервер.ТекущийПользователь(),
		                                                                                 Неопределено,
		                                                                                 Дата);
		
		ПодписиРуководитель              = ПодписиУполномоченныхЛиц.Получить(ПредопределенноеЗначение("Перечисление.ОтветственныеЛицаОрганизаций.Руководитель"));
		ПодписиГлавныйБухгалтер          = ПодписиУполномоченныхЛиц.Получить(ПредопределенноеЗначение("Перечисление.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер"));
		ПодписиОтветственныйЗаОформление = ПодписиУполномоченныхЛиц.Получить(ПредопределенноеЗначение("Перечисление.ОтветственныеЛицаОрганизаций.ОтветственныйЗаОформление"));
		
		Руководитель                     = ПодписиРуководитель.ФизическоеЛицо;
		ЗаРуководителяНаОсновании        = ПодписиРуководитель.ОснованиеПраваПодписи;
		ГлавныйБухгалтер                 = ПодписиГлавныйБухгалтер.ФизическоеЛицо;
		ЗаГлавногоБухгалтераНаОсновании  = ПодписиГлавныйБухгалтер.ОснованиеПраваПодписи;
		ОтветственныйЗаОформление        = ПодписиОтветственныйЗаОформление.ФизическоеЛицо;
		
	Иначе
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,
		                         ДокументОснования,
		                         "Руководитель,
		                         |ЗаРуководителяНаОсновании,
		                         |ГлавныйБухгалтер,
		                         |ЗаГлавногоБухгалтераНаОсновании,
		                         |ОтветственныйЗаОформление");
		
	КонецЕсли;
	
КонецПроцедуры
